/*ავიღე 3 რიცხვიანი მატრიცა რათა უფრო მარტივი იყოს პრინციპის დანახვა*/

#include <iostream>


int
    main ()
{
    int masivi[3] = {2,1,5};

    for (int i = 0; i < 3; i++) {
        
        for (int j = i + 1; j < 3;j++){
            
            if ( masivi[i] < masivi[j]){
                int droebiti = masivi[i];
                masivi[i] = masivi[j];
                masivi[j] = droebiti; 
            }
        }
    }
/*ალგორითმის პრინციპი (ჩემი თვალით დანახული)*/
/*ალგორითმი თავიდან იღებს მატრიცის პირველ რიცხვს და მას ადარებს მის შემდგომებს
2 < 1 ეს პირველი შედარება იქნება რადგან მცდარია არაფერი მოხდება
2 < 5 რადგან ჭეშმარიტია ისინი ადგილებს გაცვლიან და ახალი მატრიცა იქნება {5,1,2}
შემდეგ გადავა 1 ზე
1 < 2 ჭეშმარიტია გაცვლიან ადგილებს ახალი მატრიცაა {5,2,1}
*/

/*იმისათვის რომ ზრდადობაზე გადავაკეთოთ უბრალოდ საჭიროა masivi[i] > masivi[j] ზე დავწეროთ*/

    for (int i = 0; i < 3; i ++) {
        std::cout<<masivi[i]<<" ";
    }
/*ამ ციკლით გამოგვაქვს ახალი დალაგებული მატრიცა*/
  return 0;
}
